[
  {
    "toyId": 1,
    "toyName": "Explorer Microscope",
    "sellerName": "Science Kits Direct",
    "sellerEmail": "support@sciencekits.com",
    "price": 79.99,
    "rating": 4.8,
    "availableQuantity": 55,
    "description": "The Explorer Microscope is an essential piece of equipment for the budding scientist, designed to introduce children to the fascinating world of microbiology and cellular structures. It features high-quality glass optics, offering magnification levels up to 1200x, which is perfectly adequate for viewing prepared slides of plant cells, insect parts, and even microorganisms from pond water. The body is constructed from durable, child-safe metal and plastic, ensuring it can withstand the enthusiasm of young users. It includes both an upper LED light for viewing opaque objects like leaves and coins, and a lower LED light for translucent slide specimens, providing bright, clear images. The kit comes complete with a comprehensive set of accessories to get started immediately, including five prepared slides showcasing different biological samples, five blank slides for collecting and preparing their own specimens, a dropper, tweezers, and a small specimen container. This hands-on tool is not just a toy; it’s an **educational instrument** that fosters a deep curiosity about biology, chemistry, and the natural world. It encourages observational skills, attention to detail, and a methodical approach to experimentation. Using a microscope can help children understand scientific methodology, making hypotheses, testing them, and recording observations. This kind of interactive learning transcends traditional textbook knowledge, creating lasting memories and a foundational appreciation for science, technology, engineering, and mathematics (STEM). The adjustable focus knob is oversized for small hands, making it easy for children as young as eight to achieve a crisp, clear image. Furthermore, it includes a helpful, detailed instruction booklet with project ideas and safety guidelines, making the exploration safe and accessible for the whole family. The robust carrying case allows for easy storage and transportation, meaning the scientific exploration doesn't have to be limited to the desk, but can extend to the backyard, park, or beach, turning every outdoor trip into a research expedition. The battery-operated lighting system ensures portability and safety, eliminating the need for complex wiring. It’s an investment in your child's future intellectual development, encouraging critical thinking and problem-solving skills that are invaluable in any field of study or career path. The magnification power is clearly marked and easy to switch between, which aids in understanding scale and relative size. Overall, this kit provides a fun, engaging, and highly educational experience that will spark a lifelong love for scientific discovery.",
    "pictureURL": "https://i.ibb.co.com/p6GqWvgw/12121.png",
    "subCategory": "Science Kits"
  },
  {
    "toyId": 2,
    "toyName": "Wooden Stacking",
    "sellerName": "Eco Play Store",
    "sellerEmail": "hello@ecoplay.com",
    "price": 24.50,
    "rating": 4.9,
    "availableQuantity": 120,
    "description": "The Wooden Stacking toy is a classic, foundational educational tool designed for toddlers and preschoolers, aiming to enhance essential **motor skills** and early cognitive development. Crafted from sustainable, solid wood and finished with non-toxic, water-based paints, this toy is completely safe for babies who are still exploring the world with their mouths. The set typically consists of a sturdy wooden base with three central dowels and various brightly colored wooden rings, squares, and triangular blocks. The core challenge for the child is to sort and stack these pieces onto the correct dowels, often matching shapes, colors, or sizes. This simple yet profound activity is instrumental in developing hand-eye coordination, as the child must accurately guide the hole in the block over the thin dowel rod. Furthermore, it introduces fundamental concepts of size and sequence. Children learn to differentiate between 'big' and 'small' as they attempt to stack the pieces in ascending or descending order, which is a key precursor to understanding mathematical concepts. The different shapes—circles, squares, and triangles—help in early geometric recognition and shape differentiation. The vibrant, contrasting colors (red, blue, green, yellow) are visually stimulating and help with color identification and sorting activities. Beyond the basic stacking, the smooth, warm texture of the natural wood provides a pleasant tactile experience, engaging the child's senses in a way plastic toys often do not. The durability of the hardwood ensures that this toy can withstand years of enthusiastic play, easily passed down through siblings or generations. It encourages independent play and focused concentration; a child must sit and concentrate on the task, slowly building their attention span. It's a wonderful alternative to electronic toys, promoting imagination and open-ended play, as the pieces can also be used for creative building or balancing games off the dowel base. This toy is highly effective in teaching **problem-solving skills**; if a piece doesn't fit, the child must figure out why, perhaps realizing they are trying to put a square on a round peg, or that a larger piece won't fit on top of a smaller one in the desired order. The simplicity of the design is its strength, offering unlimited ways to learn and interact, making it a staple in any quality early childhood toy collection. It perfectly adheres to Montessori principles by offering a hands-on, self-correcting learning experience.",
    "pictureURL": "https://i.ibb.co.com/k6y1tDBr/67.png",
    "subCategory": "Toddler Toys"
  },
  {
    "toyId": 3,
    "toyName": "Remote Control",
    "sellerName": "Tech Toys Hub",
    "sellerEmail": "sales@techtoys.com",
    "price": 59.99,
    "rating": 4.6,
    "availableQuantity": 40,
    "description": "The Remote Control Stunt Car is a high-octane, durable vehicle designed to provide endless entertainment for kids and adults alike. Engineered for extreme performance, this car is equipped with robust, shock-proof tires that can handle a variety of terrains, including grass, gravel, concrete, and indoor flooring, making it the perfect all-terrain vehicle. Its most exciting feature is its ability to perform spectacular stunts, including 360-degree flips, dizzying spins, and high-speed drifts, all controlled effortlessly by the child using the intuitive, pistol-grip remote controller. The controller operates on a 2.4 GHz frequency, which provides an extended control range of up to 50 meters and allows multiple cars to be operated simultaneously without interference, perfect for competitive racing among friends. The car features a powerful, rechargeable lithium-ion battery that provides an impressive 25 minutes of continuous run time on a single charge, ensuring long play sessions before needing a quick recharge via the included USB cable. The bright LED headlights and taillights not only look incredibly cool, especially in low light conditions but also help with orientation when the car is performing distant maneuvers. Playing with a remote control car like this is more than just fun; it significantly improves a child’s spatial reasoning and **hand-eye coordination**. They must anticipate the car's movement, judge distances, and quickly react to obstacles, all while operating the dual joysticks on the remote. This rapid decision-making process is an excellent cognitive exercise. The rugged ABS plastic shell is designed to absorb impacts from high-speed crashes and tumbles, ensuring longevity and durability. The aggressive, futuristic styling, often featuring vibrant racing stripes and a sleek silhouette, captures the imagination and encourages thrilling, imaginative play scenarios, from cross-country rally racing to navigating complex obstacle courses built from household objects. It encourages outdoor activity and friendly competition, pulling children away from screens and into active play. The internal motor is surprisingly powerful, allowing the car to reach speeds of up to 15 km/h, adding an element of genuine excitement and mastery to the play experience. It’s an ideal gift for children aged 6 and up who love speed, action, and the satisfaction of mastering a dynamic, challenging toy. The precision steering and responsive throttle make it feel like operating a real miniature race car.",
    "pictureURL": "https://i.ibb.co.com/35y866s2/33.png",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 4,
    "toyName": "Art Easel",
    "sellerName": "Creative Kids Co.",
    "sellerEmail": "shop@creativekids.net",
    "price": 85.00,
    "rating": 4.7,
    "availableQuantity": 30,
    "description": "The Deluxe Double-Sided Art Easel is a magnificent centerpiece for any budding artist's playroom or classroom, providing a dedicated space for creative expression and collaborative learning. This professional-grade easel is constructed from sturdy, ethically sourced pine wood, ensuring stability and a beautiful, natural aesthetic. It is cleverly designed to be double-sided, featuring a large, high-quality **chalkboard** on one side and a premium **dry-erase whiteboard** on the other, allowing two children to create masterpieces simultaneously, which is excellent for fostering peer interaction and cooperative play. The height is fully adjustable, meaning the easel can grow with the child, accommodating artists from toddler age right up through the early elementary years, maximizing its lifespan and utility. Below the drawing surfaces, a large, integrated plastic tray provides ample storage for art supplies, keeping chalk, markers, paint cups, erasers, and brushes neatly organized and easily accessible. A tension clip is mounted at the top of the whiteboard side, allowing a roll of paper (often included or sold separately) to be securely attached and pulled down, transforming the easel into a painting or drawing station for permanent creations. This versatility encourages children to experiment with different media—from the broad strokes of chalk to the fine lines of a marker or the fluid nature of paint. The act of drawing, whether standing or sitting, helps develop a child's fine motor skills, strengthens their grip, and improves their posture. More importantly, it is a powerful tool for self-expression and emotional development. Children can use the easel to illustrate stories, practice writing letters and numbers, or simply let their imagination run wild. Parents and teachers often use the whiteboard side for educational games and tutoring, making learning interactive and fun. The large format encourages big, expansive movements, which are important for developing pre-writing and drawing confidence. Assembly is straightforward, and the easel folds flat for convenient storage when not in use. It is a true investment in fostering **creativity**, literacy, and numeracy in a highly engaging, hands-on manner.",
    "pictureURL": "https://i.ibb.co.com/NHLhBrJ/11.png",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 5,
    "toyName": "Plush Unicorn",
    "sellerName": "Cuddle Buddies Inc.",
    "sellerEmail": "support@cuddlebuddies.com",
    "price": 19.99,
    "rating": 4.9,
    "availableQuantity": 200,
    "description": "The Magical Plush Unicorn is an exceptionally soft and enchanting stuffed animal designed to be a child's comforting companion and a catalyst for imaginative, fantasy-based play. Standing at a perfect huggable size of approximately 18 inches, it is crafted from premium, high-pile polyester fabric that is unbelievably soft to the touch, making it ideal for snuggling during nap time, long car rides, or scary nights. This particular unicorn features a shimmering silver horn, delicate embroidered eyes, and a flowing, rainbow-colored mane and tail made from soft, brushable yarn, which adds an interactive element where children can practice grooming and styling, enhancing their fine motor skills through play. The body is densely filled with hypoallergenic stuffing, ensuring it maintains its plump, delightful shape even after repeated hugs and washes. Stuffed animals, especially those with a fantastical theme like a unicorn, play a critical role in a child's **emotional development**. They often become transitional objects, providing comfort and security in new or stressful situations. Children frequently project their feelings and concerns onto their plush friends, using them to act out social situations, practice conversations, and explore complex emotions, which is vital for building empathy and social skills. The unicorn encourages narrative play; children can invent elaborate stories about flying to magical kingdoms, granting wishes, or embarking on brave quests, all of which strengthen their **storytelling abilities** and expand their vocabulary. Its durable construction means all seams are double-stitched and all parts, including the horn and hooves, are securely attached, making it safe for children of all ages. This unicorn is more than a toy; it’s a silent friend, a listener, and a partner in countless adventures, fostering a sense of warmth, security, and limitless imagination. It's a perennial favorite that quickly becomes a cherished heirloom. It's surface-washable, making it easy to keep clean from the inevitable spills and dirt that come with a child's best friend. The weight and texture are soothing, providing a calm, sensory input that can help regulate emotions and encourage relaxation, making it an excellent tool for quiet time.",
    "pictureURL": "https://i.ibb.co.com/dwxmrYSW/32.png",
    "subCategory": "Stuffed Animals"
  },
  {
    "toyId": 6,
    "toyName": "Musical Keyboard",
    "sellerName": "Music Makers Store",
    "sellerEmail": "info@musicmakers.com",
    "price": 65.99,
    "rating": 4.5,
    "availableQuantity": 60,
    "description": "The Junior Musical Keyboard is an engaging, entry-level electronic instrument designed specifically for young children to introduce them to the fundamental concepts of music and rhythm. This compact keyboard features 37 full-sized keys, which are perfectly sized for small fingers to navigate comfortably, alongside a variety of stimulating functions that make learning fun and accessible. It includes multiple instrument voices, such as piano, organ, violin, and trumpet, allowing the child to experiment with different timbres and sounds, broadening their auditory palate. Furthermore, it comes equipped with pre-recorded demo songs and various rhythm patterns (like rock, disco, and waltz) that children can play along with, helping them develop a strong sense of timing and beat. The keyboard also features a basic recording and playback function, which is a fantastic tool for encouraging **self-assessment** and creativity, allowing the child to hear their own compositions and improve their playing. Learning to play an instrument, even a simple electronic one, is highly beneficial for cognitive development. It utilizes both the left and right hemispheres of the brain simultaneously, improving mathematical reasoning, pattern recognition, and memory skills. The coordination required to press the correct key at the right time significantly boosts **fine motor skills** and hand-eye coordination. The clear, built-in speaker provides quality sound, and there is often a headphone jack included for quiet practice sessions. The brightly colored buttons and simple, intuitive interface ensure that children as young as three or four can begin exploring musical concepts independently. This keyboard is powered by batteries or an optional AC adapter, ensuring portability for impromptu performances. It’s an ideal toy for sparking a lifelong interest in music, providing a creative outlet, and building confidence as children master simple melodies and perform for their family and friends. The instrument often includes a color-coded teaching system or stickers to help beginners quickly identify notes. It is a toy that transitions seamlessly from simple noise-making exploration to genuine musical instruction, making it a valuable educational asset for years. The satisfaction of creating music is a profound reward that encourages continued engagement and practice.",
    "pictureURL": "https://i.ibb.co.com/RpXQvPXX/licensed-image.jpg",
    "subCategory": "Musical Toys"
  },
  {
    "toyId": 7,
    "toyName": "Doll House",
    "sellerName": "Imagination Land",
    "sellerEmail": "service@imaginationland.com",
    "price": 120.00,
    "rating": 4.8,
    "availableQuantity": 25,
    "description": "The Grand Classic Doll House is a magnificent, multi-story structure designed to be a durable canvas for endless hours of imaginative play and social role-playing. Standing over three feet tall, this meticulously detailed dollhouse is constructed from high-quality engineered wood, ensuring it is robust enough to withstand enthusiastic play while being a beautiful piece of furniture. It typically features three or more levels, multiple rooms (including a kitchen, living room, bedroom, and bathroom), and often includes balconies, grand staircases, and open access on all sides for easy play. The detailed, colorful artwork on the interior walls and floors provides realistic backdrops for creative scenarios. Playing with a dollhouse is exceptionally beneficial for a child’s development, particularly in the areas of **social skills** and **emotional literacy**. As children manipulate dolls (not included) through various daily routines—from waking up and eating breakfast to hosting a party or dealing with a conflict—they are practicing and processing real-world social interactions. They can role-play family dynamics, explore different professions, and understand concepts like cooperation, sharing, and conflict resolution in a safe, controlled environment. This type of open-ended, dramatic play is critical for strengthening narrative thinking and language development. Children narrate the dolls' actions, using complex sentences and expanding their vocabulary to describe emotions, settings, and events. The detailed miniature furniture (often sold separately or included in deluxe sets) encourages fine motor manipulation as children arrange tiny chairs, beds, and kitchen items, which sharpens their dexterity. The large size encourages parallel and cooperative play among siblings or friends, fostering turn-taking and shared storytelling. The dollhouse serves as a three-dimensional backdrop where children are the directors, writers, and actors, giving them a sense of control and mastery over their miniature world. It's a timeless toy that promotes a deep level of engaged, screen-free play. The robust, classic design ensures it can be enjoyed for years and potentially become a treasured family heirloom.",
    "pictureURL": "https://i.ibb.co.com/VcsMrtX4/12.png",
    "subCategory": "Pretend Play"
  },
  {
    "toyId": 8,
    "toyName": "Train Set",
    "sellerName": "Toy Tracks Emporium",
    "sellerEmail": "support@toytrains.com",
    "price": 45.99,
    "rating": 4.7,
    "availableQuantity": 90,
    "description": "The Classic Wooden Train Set is an iconic, highly versatile toy that offers a brilliant blend of construction, imaginative play, and early physics lessons. This comprehensive starter set typically includes a battery-operated locomotive with forward and reverse functions, several different train cars (e.g., freight, passenger, caboose), various wooden track pieces (straight, curved, intersection), and supplementary accessories like trees, signs, and miniature townspeople to populate the railway's landscape. The core fun lies in the construction of the track layout. Children must use **spatial reasoning** and problem-solving skills to connect the wooden pieces, figuring out how to make a complete loop, navigate obstacles, or build a complex interlocking network. This hands-on process is fantastic for developing **fine motor skills** and logical thinking—understanding that two curved pieces make a corner, or that a bridge requires a ramp piece on either side. The train cars connect using simple, child-safe magnets, a great introduction to the concepts of magnetic force and polarity. Once the track is built, the imaginative play begins. Children take on the role of the conductor, the passengers, the station master, and the town residents, creating elaborate stories about the journeys the train takes, the cargo it carries, and the destinations it reaches. This rich narrative play enhances language skills, storytelling ability, and social understanding. The tracks are typically compatible with other major wooden train brands, allowing for easy expansion and combination with existing sets. Made from durable, high-quality beech wood, these pieces are designed to last and have smooth edges and non-toxic finishes for safety. The visual and auditory feedback of the train chugging along the track, often with realistic sound effects, is highly engaging and satisfying. It encourages independent focused play as well as cooperative building among friends. This set is a powerful tool for teaching patience, as the child must carefully plan and execute the track connections before the train can run smoothly, and provides immediate, rewarding feedback when the system works flawlessly. The sheer number of possible track configurations ensures that the play experience never becomes repetitive, offering virtually limitless possibilities for creativity.",
    "pictureURL": "https://i.ibb.co.com/N2khPbsp/licensed-image-1.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 9,
    "toyName": "Kitchen Playset",
    "sellerName": "Role Play Toys Inc.",
    "sellerEmail": "contact@roleplaytoys.net",
    "price": 95.50,
    "rating": 4.6,
    "availableQuantity": 35,
    "description": "The Deluxe Interactive Kitchen Playset is a highly realistic, engaging toy designed to facilitate deep, imaginative role-playing, which is paramount for developing a child's understanding of the world around them and strengthening their social competencies. This robust plastic or wooden kitchen replica typically includes all the essential appliances found in a real kitchen: a stove, oven, microwave, sink with a faucet, and storage shelves. The key feature of modern playsets is interactivity, often including realistic sounds such as the 'boiling' sound on the stovetop, the 'ding' of the oven timer, and sometimes even a water-dispensing feature in the pretend refrigerator, all of which enhance the realism and engagement. The set comes with a variety of play food, miniature pots, pans, and utensils, allowing children to immediately dive into the action of cooking and hosting. Role-playing a chef, a waiter, or a parent preparing a meal allows children to imitate adult behavior and explore complex social roles in a safe and understandable context. This kind of dramatic play is crucial for **language development**, as children use dialogue to place orders, describe their 'dishes,' and instruct others. It also builds foundational **life skills**, teaching them about nutrition, food groups, and the steps involved in meal preparation, fostering a sense of responsibility and self-sufficiency. Playing with kitchen items also helps develop fine motor skills as they manipulate small utensils, turn knobs, and open and close appliance doors. The playset encourages cooperation and negotiation when played with siblings or friends, as they must decide who takes on which role, how to share the limited 'ingredients,' and how to collaborate on a pretend meal. The detailed design, often featuring realistic graphics and storage hooks, helps teach organization and tidiness. The open-ended nature of the kitchen ensures that it can be adapted to countless scenarios—a fancy restaurant, a bustling café, a picnic preparation, or a simple family dinner—ensuring long-lasting play value and continuous creative exploration. It is a fundamental toy for fostering creativity, communication, and a practical understanding of domestic life.",
    "pictureURL": "https://i.ibb.co.com/CKGKdjN0/licensed-image-2.jpg",
    "subCategory": "Pretend Play"
  },
  {
    "toyId": 10,
    "toyName": "Tricycle Scooter",
    "sellerName": "Outdoor Fun Gear",
    "sellerEmail": "hello@outdoorfun.com",
    "price": 75.00,
    "rating": 4.8,
    "availableQuantity": 50,
    "description": "The Convertible Tricycle Scooter is an innovative and versatile ride-on toy designed to adapt to a child's developmental stages, transitioning seamlessly from a stable three-wheeled tricycle to a two-wheeled balance bike or a lean-to-steer scooter, depending on the model's design. This multi-stage functionality provides an extended period of utility and allows the child to master various forms of mobility. Constructed with a lightweight yet incredibly durable aluminum frame, it is easy for small children to maneuver and control. The wheels are typically made of high-quality, non-marking PU for a smooth, quiet ride both indoors and outdoors, and the rear wheel often includes a responsive foot brake for added safety and control. The adjustable handlebar and seat height ensure a perfect fit for children aged from 18 months up to five years. Introducing a child to a tricycle or scooter at an early age is immensely beneficial for developing gross motor skills, which involve the large muscles of the body. Pedaling or pushing off the ground strengthens leg muscles, improves stamina, and enhances coordination. Most importantly, it is a crucial tool for developing **balance and spatial awareness**. As a child learns to steer by leaning (on a scooter) or turning the handlebars, they are actively refining their proprioception and vestibular system, which are essential for overall physical coordination. The sense of freedom and accomplishment a child gains from riding their own vehicle independently is a huge boost to their **self-confidence** and self-esteem. It encourages outdoor play, promoting a healthy, active lifestyle and reducing screen time. The safety features are paramount, including non-slip grips on the handlebars and a low-to-the-ground design for easy mounting and dismounting, minimizing the risk of falls. The convertible nature means that as the child masters one mode of transportation, they can easily transition to a more complex one, offering a continuous learning curve and preventing the toy from being quickly outgrown. It's an excellent investment in a child’s physical development, providing them with the tools for active, engaging, and joyful outdoor adventure.",
    "pictureURL": "https://i.ibb.co.com/xtkLvNsG/77.png",
    "subCategory": "Outdoor Play"
  },
  {
  "toyId": 11,
  "toyName": "Wooden Rings",
  "sellerName": "Tiny Builders Co.",
  "sellerEmail": "support@tinybuilders.com",
  "price": 25.50,
  "rating": 4.9,
  "availableQuantity": 150,
  "description": "The Classic Wooden Stacking Rings set is an essential toy for early childhood development. It typically consists of a wooden base, a center post, and several colorful, varying-sized rings meant to be placed onto the post in the correct order. The rings are often painted with non-toxic, child-safe water-based paint. This simple yet effective toy is instrumental in teaching children fundamental concepts like **size differentiation, sequencing, and color recognition**. Manipulating the rings and placing them onto the post greatly enhances **fine motor skills** and **hand-eye coordination**, which are crucial for later tasks like writing and self-feeding. It encourages problem-solving as the child figures out the correct order. Made from sustainably sourced, durable wood, this toy is built to last and is a safer, more eco-friendly alternative to plastic options. It is suitable for children aged 12 months and up.",
  "pictureURL": "https://i.ibb.co.com/rfwdFKR3/789.png",
  "subCategory": "Developmental Toys"
},
{
  "toyId": 12,
  "toyName": "Control Car (Off-Road)",
  "sellerName": "Power Hobby Zone",
  "sellerEmail": "contact@powerhobby.net",
  "price": 120.99,
  "rating": 4.5,
  "availableQuantity": 35,
  "description": "This high-performance Remote Control Off-Road Car is designed for exciting play on rough terrain. It features a robust, shock-proof chassis, large-tread rubber tires for superior grip, and an independent suspension system, allowing it to conquer grass, dirt, and gravel with ease. Powered by a high-capacity rechargeable battery, it offers extended playtime and impressive speeds. Operating the multi-function controller is an excellent way for older children (6 years and up) to develop and refine their **spatial reasoning** and **hand-eye coordination**. Navigating the car through complex outdoor environments requires focus and strategic thinking, fostering **problem-solving skills** as they overcome obstacles. The durable ABS plastic body shell is designed to withstand flips and bumps, ensuring longevity. It provides an engaging, active experience that encourages outdoor adventure and competitive play.",
  "pictureURL": "https://i.ibb.co.com/5WSZBcBj/4455.png",
  "subCategory": "Vehicles & RC"
}
]